---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SketchFailures.EndsNotOnCutFace
source: html/f37b0ecb-70a0-726e-3044-cfadec3c5616.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SketchFailures.EndsNotOnCutFace Property

Ends of the sketched loop do not lie on the boundary of the face being modified.

## Syntax (C#)
```csharp
public static FailureDefinitionId EndsNotOnCutFace { get; }
```